ReactProjects/youtube-clone/tests/load-testing/artillery-config.yml
# Artillery Load Testing Configuration
# Alternative to k6, uses Artillery for HTTP load testing
# 
# Install: npm install -g artillery
# Run: artillery run artillery-config.yml
# Run with report: artillery run --output report.json artillery-config.yml && artillery report report.json

config:
  target: "http://localhost:3000"
  phases:
    # Warm-up phase
    - duration: 30
      arrivalRate: 5
      name: "Warm up"
    
    # Ramp up
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: "Ramp up load"
    
    # Sustained load
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
    
    # Peak load
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
    
    # Cool down
    - duration: 30
      arrivalRate: 10
      name: "Cool down"
  
  # Performance thresholds
  ensure:
    maxErrorRate: 5          # Max 5% error rate
    p95: 2000               # 95th percentile under 2000ms
    p99: 3000               # 99th percentile under 3000ms
  
  # Payload data
  payload:
    path: "./test-data.csv"
    fields:
      - userId
      - videoId
    order: random
  
  # Custom metrics
  plugins:
    metrics-by-endpoint:
      stripQueryString: true
    expect:
      outputFormat: json

scenarios:
  # Scenario 1: Browse home feed with recommendations
  - name: "Browse Home Feed"